/** @format */

import Nav from '@app/components/common/nav/Nav';
import './Risks.scss';
import { ImageType } from '@app/types/image.type';

export default function Risks() {
    return (
        <>
            <Nav />

            <div className="risks">
                <main>
                    <div className="wrapper QVgK6r">
                        <div className="kyFSsT">
                            <h1 className="omT61_">Что мы анализируем?</h1>
                            <p className="IjWeQh">
                                Мы проводим анализ адресов на принадлежность к
                                более чем 20 источникам риска, чтобы найти
                                подозрительные транзакции и определить
                                коэффициент риска. Все источники мы разбили на
                                три категории.
                            </p>
                        </div>
                        <div className="CBgIA7">
                            <img
                                alt=""
                                loading="lazy"
                                width="1089"
                                height="864"
                                decoding="async"
                                style={{ color: 'transparent' }}
                                src={ImageType.RISKS}
                            />
                        </div>
                    </div>
                </main>
                <div className="N1ghMb">
                    <div className="wrapper">
                        <div className="LKg7F8">
                            <div
                                className="T60tiO VKj4El aos-init aos-animate"
                                data-aos="fade-up">
                                <h2 className="ZBRuBI">Danger</h2>
                                <ul className="_1rnAH3">
                                    <li>
                                        <h4>Child Exploitation</h4>
                                        <p>
                                            Субъекты, связанные с эксплуатацией
                                            детей.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Dark Market</h4>
                                        <p>
                                            Монеты, связанные с незаконной
                                            деятельностью.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Dark Service</h4>
                                        <p>
                                            Монеты, связанные с жестоким
                                            обращением с детьми, финансированием
                                            терроризма или торговлей
                                            наркотиками.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Enforcement action</h4>
                                        <p>
                                            Юридическое лицо подлежит судебному
                                            разбирательству с судебными
                                            органами.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Fraudulent Exchange</h4>
                                        <p>
                                            Биржи, вовлеченные в аферы с
                                            выходом, незаконным поведением, или
                                            у которых средства были конфискованы
                                            органами государственной власти.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Gambling</h4>
                                        <p>
                                            Монеты, связанные с
                                            нелицензированными онлайн-играми.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Illegal Service</h4>
                                        <p>
                                            Монеты, связанные с незаконной
                                            деятельностью.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Mixer</h4>
                                        <p>
                                            Монеты, пропущенные через миксер,
                                            чтобы затруднить или сделать
                                            невозможным отслеживание. Микcеры в
                                            основном используются для отмывания
                                            денег.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Ransom</h4>
                                        <p>
                                            Монеты, полученные путем
                                            вымогательства или шантажа.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Sanctions</h4>
                                        <p>
                                            Субъекты, к которым применены
                                            санкции.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Scam</h4>
                                        <p>Монеты, полученные путем обмана.</p>
                                    </li>
                                    <li>
                                        <h4>Stolen Coins</h4>
                                        <p>
                                            Монеты, полученные путем хищения
                                            чужой криптовалюты.
                                        </p>
                                    </li>
                                    <li>
                                        <h4>Terrorism Financing</h4>
                                        <p>
                                            Субъекты, связанные с
                                            финансированием терроризма.
                                        </p>
                                    </li>
                                </ul>
                            </div>
                            <aside
                                className="to0ENu aos-init aos-animate"
                                data-aos="fade-up"
                                data-aos-delay="100">
                                <div className="WAnByI">
                                    <h3>Будьте осторожны!</h3>
                                    <p>
                                        Присутствие{' '}
                                        <b>
                                            Dark Market, Dark Service, Illegal
                                            Service
                                        </b>{' '}
                                        – это плохой знак.
                                    </p>
                                    <p>
                                        Рекомендуем провести дополнительные
                                        исследования, чтобы не потерять свои
                                        средства из-за блокировок.
                                    </p>
                                </div>
                            </aside>
                        </div>
                        <div
                            className="T60tiO LdS5QO aos-init"
                            data-aos="fade-up">
                            <h2 className="ZBRuBI">Suspicious sources</h2>
                            <ul className="_1rnAH3">
                                <li>
                                    <h4>ATM</h4>
                                    <p>
                                        Монеты, полученные через оператора
                                        криптовалютного банкомата.
                                    </p>
                                </li>
                                <li>
                                    <h4>Exchange | High Risk</h4>
                                    <p>
                                        Субъект становится высокорисковым на
                                        основании следующих критериев:
                                        <br />
                                        <br /> Нет KYC: не требует абсолютно
                                        никакой информации о клиенте, прежде чем
                                        разрешать любой уровень депозита/снятия
                                        средств, или не предпринимает попыток
                                        проверить эту информацию.
                                        <br />
                                        <br /> Криминальные связи: уголовные
                                        обвинения юридического лица в связи с
                                        нарушениями AML/CFT.
                                        <br />
                                        <br /> Воздействие: высокий уровень
                                        подверженности рискованным услугам,
                                        таким как рынки даркнета, другие биржи с
                                        высоким риском или смешение
                                        определяется, как услуга, прямая
                                        подверженность высокому риску которой
                                        отличается на одно стандартное
                                        отклонение от среднего значения всех
                                        идентифицированных организаций по обмену
                                        за 12-месячный период.
                                        <br />
                                        <br /> Юрисдикция: базируется в
                                        юрисдикции со слабыми мерами AML/CFT.
                                        <br />
                                        <br /> Без лицензии: не имеет какой-либо
                                        конкретной лицензии на ведение торговли
                                        криптовалютой.
                                    </p>
                                </li>
                                <li>
                                    <h4>Liquidity Pools</h4>
                                    <p>
                                        Смарт-контракты, в которых токены
                                        блокируются для обеспечения ликвидности.
                                    </p>
                                </li>
                                <li>
                                    <h4>P2P Exchange | High Risk</h4>
                                    <p>
                                        Организация не имеет какой-либо
                                        специальной лицензии на ведение бизнеса,
                                        связанного с предоставлением услуг по
                                        обмену криптовалюты, когда участники
                                        обмениваются напрямую друг с другом, без
                                        посредников.
                                        <br />
                                        <br /> Сюда также входят организации,
                                        которые имеют лицензию, но находятся в
                                        перечисленных юрисдикциях, внесены в
                                        список несотрудничающих компаний FATF
                                        или не предоставляют KYC для транзакций
                                        на крупные суммы, что делает их
                                        привлекательными для отмывания денег.
                                    </p>
                                </li>
                                <li>
                                    <h4>Unnamed Service</h4>
                                    <p>
                                        Категория относится к
                                        неидентифицированным в настоящее время
                                        кластерам, которые демонстрируют
                                        поведение, ожидаемое от службы, по
                                        большому количеству адресов и
                                        транзакций.
                                    </p>
                                </li>
                            </ul>
                        </div>
                        <div
                            className="T60tiO _3s_fHl aos-init"
                            data-aos="fade-up">
                            <h2 className="ZBRuBI">Trusted sources</h2>
                            <ul className="_1rnAH3">
                                <li>
                                    <h4>Exchange</h4>
                                    <p>
                                        Организация позволяет пользователям
                                        покупать, продавать и торговать
                                        криптовалютами, обладая торговыми
                                        лицензиями, которые включают следующие
                                        аспекты услуг:
                                        <br /> —Депозитарные, брокерские или
                                        другие связанные финансовые услуги,
                                        которые предоставляют услуги обмена, где
                                        взаимодействуют участники с центральной
                                        стороной.
                                        <br />
                                        <br /> И не включает:
                                        <br /> — Лицензии на неспецифические
                                        финансовые услуги и юрисдикции,
                                        включенные в список FATF.
                                        <br />
                                        <br /> Они представляют собой наиболее
                                        важную и наиболее используемую категорию
                                        субъектов в индустрии криптовалют, на
                                        которую приходится 90% всех средств,
                                        отправленных через эти сервисы.
                                    </p>
                                </li>
                                <li>
                                    <h4>ICO</h4>
                                    <p>
                                        Организация, которая занимается
                                        краудфандингом своего проекта, продавая
                                        свою новоиспеченную криптовалюту
                                        инвесторам в обмен на фиатную валюту или
                                        более распространенные криптовалюты,
                                        такие как биткойн и эфир.
                                        <br />
                                        <br /> Существует много законных
                                        примеров таких предложений, но также и
                                        много случаев, где злоумышленники
                                        собирают средства через ICO, затем
                                        присваивают деньги и исчезают.
                                    </p>
                                </li>
                                <li>
                                    <h4>Marketplace</h4>
                                    <p>
                                        Монеты, использованные для оплаты
                                        законной деятельности.
                                    </p>
                                </li>
                                <li>
                                    <h4>Merchant Services</h4>
                                    <p>
                                        Организация, которая позволяет компаниям
                                        принимать платежи от своих клиентов,
                                        также известная как платежные шлюзы или
                                        обработчики платежей.
                                        <br />
                                        <br /> Он часто облегчает конвертацию в
                                        местную фиатную валюту и перевод средств
                                        на банковский счет продавца.
                                    </p>
                                </li>
                                <li>
                                    <h4>Miner</h4>
                                    <p>
                                        Монеты, добытые майнерами и еще не
                                        перенаправленные.
                                    </p>
                                </li>
                                <li>
                                    <h4>Other</h4>
                                    <p>
                                        Монеты, полученные с помощью аирдропов,
                                        продажи токенов или другими способами.
                                    </p>
                                </li>
                                <li>
                                    <h4>P2P Exchange</h4>
                                    <p>
                                        Организация имеет лицензию на ведение
                                        бизнеса, связанного с предоставлением
                                        услуг по обмену криптовалюты, когда
                                        участники обмениваются напрямую друг с
                                        другом, без посредников.
                                        <br />
                                        <br /> Сюда не входят лицензии на
                                        неспецифические финансовые услуги и
                                        юрисдикции, которые в несотрудничающем
                                        списке FATF.
                                    </p>
                                </li>
                                <li>
                                    <h4>Payment Processor</h4>
                                    <p>
                                        Монеты, связанные с платежными услугами.
                                    </p>
                                </li>
                                <li>
                                    <h4>Seized Assets</h4>
                                    <p>
                                        Криптоактивы, арестованные органами
                                        государственной власти.
                                    </p>
                                </li>
                                <li>
                                    <h4>Wallet</h4>
                                    <p>
                                        Онлайн кошелек - это сервис для хранения
                                        и совершения транзакций с криптовалютой.
                                        Кастодиальные кошельки - это один из
                                        типов онлайн кошельков, где сервис
                                        хранит приватные ключи пользователя, что
                                        может создать потенциальные риски
                                        мошенничества или недостаточной
                                        безопасности, но в целом репутабельные
                                        поставщики могут обеспечивать лучшую
                                        безопасность, чем сами неопытные
                                        пользователи.
                                    </p>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </>
    );
}
